MESSAGES = {
    'message_5': {
        'text': (
            'Далее будет 10 вопросов, в каждом из них – шесть утверждений.\n'
            'Выбирай утверждения в каждом вопросе по степени привлекательности'
        ),
        'buttons': {
            'Далее': 'Далее'
        }
    },
    'message_6': {
        'text': '1. Мне хотелось бы в своей профессиональной деятельности',
        'buttons': {
            'А': 'общаться с разными людьми',
            'Б': ('снимать фильмы, писать книги, '
                  'рисовать, выступать на сцене и т.д.'),
            'В': ('заниматься расчетами, вести документацию, '
                  'собирать и анализировать данные'),
            'Г': ('создавать материальные объекты '
                  '(строить дома, делать мебель, '
                  'шить одежду, разводить собак и др.)'),
            'Д': ('заниматься защитой объектов и людей '
                  '(лечить пациентов, охранять имущество и людей и др.)'),
            'Е': 'проводить исследования',
        },
    },
    'message_7': {
        'text': (
            '2. Если выбирать из шести вариантов, я скорее соглашусь стать'
        ),
        'buttons': {
            'А': 'психологом',
            'Б': 'художником',
            'В': 'секретарем',
            'Г': 'водителем',
            'Д': 'спасателем',
            'Е': 'ученым',
        },
    },
    'message_8': {
        'text': '3. Если я стану руководителем, то в первую очередь',
        'buttons': {
            'А': 'создам дружный, сплоченный коллектив',
            'Б': 'разработаю логотип, дизайн интерьера',
            'В': 'соберу и проанализирую информацию об организации',
            'Г': ('займусь развитием материально-технической базы организации '
                  '(закуплю технику, транспорт, мебель и другие вещи, '
                  'которые нужны для работы)'),
            'Д': 'обеспечу безопасность',
            'Е': ('займусь научно-методическим обеспечением работы организации'
                  ' (разработаю и внедрю учебные пособия, подготовлю планы, '
                  'программы для работы и др.)'),
        },
    },
    'message_9': {
        'text': '4. В людях я ценю прежде всего',
        'buttons': {
            'А': 'душевные качества',
            'Б': 'внешнюю привлекательность',
            'В': 'пунктуальность',
            'Г': 'трудолюбие',
            'Д': 'решительность',
            'Е': 'высокий интеллект',
        },
    },
    'message_10': {
        'text': '5. Мне интереснее беседовать с друзьями',
        'buttons': {
            'А': 'о человеческих взаимоотношениях',
            'Б': 'о книгах, фильмах, музыке',
            'В': 'о цифровых технологиях',
            'Г': ('о технических характеристиках новой модели машины, '
                  'компьютера и т.п.'),
            'Д': 'об оружии и средствах защиты',
            'Е': 'о новых научных открытиях',
        },
    },
    'message_11': {
        'text': '6. Из шести возможных профилей обучения я выберу',
        'buttons': {
            'А': ('медицинский или психолого-педагогический профиль '
                  '(хочу лечить людей; обучать; разбираться в причинах '
                  'их поведения и помогать решать психологические проблемы)'),
            'Б': ('художественно-эстетический профиль '
                  '(хочу заниматься творчеством: писать картины, '
                  'танцевать, петь, снимать кино, выступать в театре и др.)'),
            'В': ('информационно-технологический профиль '
                  '(хочу работать в IT, разрабатывать умные машины '
                  'и технологии)'),
            'Г': ('индустриально-технологический профиль '
                  '(хочу быть инженером и руководить рабочим'
                  ' процессом в промышленности, машиностроении)'),
            'Д': ('военно-спортивный профиль '
                  '(люблю спорт, хочу быть сильным и стать военным)'),
            'Е': ('академический профиль '
                  '(хочу быть ученым и хорошо разбираться в своей области)'),
        },
    },
    'message_12': {
        'text': '7. Мне интереснее было бы',
        'buttons': {
            'А': 'предлагать людям товары и услуги',
            'Б': 'заниматься дизайном изделий',
            'В': 'организовывать рекламную кампанию',
            'Г': 'делать что-то своими руками',
            'Д': 'участвовать в соревнованиях',
            'Е': 'решать сложные задачи',
        },
    },
    'message_13': {
        'text': '8. Я думаю, что школа должна',
        'buttons': {
            'А': 'учить общению с другими людьми',
            'Б': 'воспитывать чувство прекрасного',
            'В': 'обучать навыкам работы с информацией',
            'Г': 'обучать навыкам практической работы',
            'Д': 'обучать основам безопасности жизнедеятельности и выживания',
            'Е': 'развивать мышление',
        },
    },
    'message_14': {
        'text': '9. В свободное время я предпочитаю',
        'buttons': {
            'А': 'общаться с друзьями и знакомиться с новыми людьми',
            'Б': ('ходить на художественные выставки, '
                  'концерты и спектакли, в музеи'),
            'В': 'узнавать что-то новое из книг, интернета, СМИ',
            'Г': ('что-нибудь мастерить, готовить, '
                  'ухаживать за кем-то (чем-то)'),
            'Д': 'тренироваться',
            'Е': 'конструировать, создавать что-то новое',
        },
    },
    'message_15': {
        'text': '10. Думаю, что мне будет комфортно работать',
        'buttons': {
            'А': 'в помещении с большим количеством людей',
            'Б': 'в мастерской или студии',
            'В': 'дома или в обычном кабинете',
            'Г': 'на свежем воздухе или в специально оборудованном помещении',
            'Д': 'в экстремальных условиях',
            'Е': 'дома, в обычном кабинете или лаборатории',
        },
    },
    'message_16': {
        'text': (
            '*У тебя склонность к:*\n'
        ),
        'buttons': {
            'Задание 2': 'Задание 2'
        }
    },
}

SCORE = {
    0: ' 0️⃣ Баллов',
    1: ' 1️⃣ Балл',
    2: ' 2️⃣ Баллa',
    3: ' 3️⃣ Баллa',
    4: ' 4️⃣ Баллa',
    5: ' 5️⃣ Баллов',
}

RESULT = {
    'А': (
'''*работе с людьми*
Необходима для профессий, связанных с управлением, обучением, воспитанием, обслуживанием (бытовым, медицинским, информационным).
Требования к профессионалу: профессиональные знания и навыки, интерес и терпимость к людям, тактичность, ответственность, развитый эмоциональный интеллект.
Примеры профессий: учитель, воспитатель, врач, тренер, психолог, продавец, менеджер.'''
    ),
    'Б': (
'''*эстетическим видам деятельности*
Необходима для творческих профессий, связанных с изобразительной, музыкальной, литературно-художественной, актерско-сценической деятельностью.
Эти профессии требуют не только профессиональных знаний и навыков, но и творческих и специальных способностей к различным видам искусства.
Примеры профессий: художник, музыкант, актер театра и кино, режиссер, дизайнер, литератор.'''
    ),
    'В': (
'''*работе с информацией*
Необходима для освоения профессий, связанных с расчетами, сбором, обработкой, анализом и преобразованием информации любого рода.
Требования к профессионалу: профессиональные знания и навыки, аккуратность, хорошее внимание, исполнительность, ответственность.
Примеры профессий: лингвист, программист, переводчик, редактор, корректор, диспетчер, делопроизводитель, секретарь.'''
    ),
    'Г': (
'''*практической деятельности*
Связана с производством и обработкой материалов; монтажом, ремонтом и обслуживанием механизмов и конструкций; управлением техникой; изготовлением изделий и продуктов; сельским хозяйством.
Требования к профессионалу: профессиональные знания и навыки, сила, ответственность, выносливость, хорошее здоровье, предметно-действенный тип мышления.
Примеры профессий: автослесарь, фермер, водитель, швея, машинист, техник, зоотехник, токарь, монтажник.'''
    ),
    'Д': (
'''*экстремальным видам деятельности*
Связана со спортом, службой в армии, оперативно-розыскной деятельностью, спасательными работами.
Требования к профессионалу: профессиональные знания и навыки, ответственность, сила, выносливость, решительность, готовность к обдуманному риску, предметно-действенный тип мышления, хорошее здоровье.
Примеры профессий: сотрудник правоохранительных органов, военный, спасатель, пожарный, водолаз, промышленный альпинист, каскадер, испытатель.'''
    ),
    'Е': (
'''*научно-исследовательской деятельности*
Связана с созданием новых технологий, исследованиями и открытиями в различных областях науки и общественной жизни.
Требования к профессионалу: высокий уровень интеллекта, критичность мышления, абстрактно-символический тип мышления, глубокие теоретические знания в своей профессиональной области и других областях, общая эрудиция, интуиция, любознательность, открытость новому опыту.
Примеры профессий: ученый, конструктор, изобретатель, исследователь.'''
    ),
}
