MESSAGES = {
    'message_5': {
        'text': (
            'Далее будет 10 вопросов, в каждом из них – шесть утверждений.\n'
            'Выбирай утверждения в каждом вопросе по степени привлекательности'
        ),
        'buttons': {
            'Начало': 'Далее'
        }
    },
    'message_6': {
        'text': '1. Мне хотелось бы в своей профессиональной деятельности',
        'buttons': {
            '1': 'общаться с разными людьми',
            '2': ('снимать фильмы, писать книги, '
                  'рисовать, выступать на сцене и т.д.'),
            '3': ('заниматься расчетами, вести документацию, '
                  'собирать и анализировать данные'),
            '4': ('создавать материальные объекты '
                  '(строить дома, делать мебель, '
                  'шить одежду, разводить собак и др.)'),
            '5': ('заниматься защитой объектов и людей '
                  '(лечить пациентов, охранять имущество и людей и др.)'),
            '6': 'проводить исследования',
        },
    },
    'message_7': {
        'text': (
            '2. Если выбирать из шести вариантов, я скорее соглашусь стать'
        ),
        'buttons': {
            '1': 'психологом',
            '2': 'художником',
            '3': 'секретарем',
            '4': 'водителем',
            '5': 'спасателем',
            '6': 'ученым',
        },
    },
    'message_8': {
        'text': '3. Если я стану руководителем, то в первую очередь',
        'buttons': {
            '1': 'создам дружный, сплоченный коллектив',
            '2': 'разработаю логотип, дизайн интерьера',
            '3': 'соберу и проанализирую информацию об организации',
            '4': ('займусь развитием материально-технической базы организации '
                  '(закуплю технику, транспорт, мебель и другие вещи, '
                  'которые нужны для работы)'),
            '5': 'обеспечу безопасность',
            '6': ('займусь научно-методическим обеспечением работы организации'
                  ' (разработаю и внедрю учебные пособия, подготовлю планы, '
                  'программы для работы и др.)'),
        },
    },
    'message_9': {
        'text': '4. В людях я ценю прежде всего',
        'buttons': {
            '1': 'душевные качества',
            '2': 'внешнюю привлекательность',
            '3': 'пунктуальность',
            '4': 'трудолюбие',
            '5': 'решительность',
            '6': 'высокий интеллект',
        },
    },
    'message_10': {
        'text': '5. Мне интереснее беседовать с друзьями',
        'buttons': {
            '1': 'о человеческих взаимоотношениях',
            '2': 'о книгах, фильмах, музыке',
            '3': 'о цифровых технологиях',
            '4': ('о технических характеристиках новой модели машины, '
                  'компьютера и т.п.'),
            '5': 'об оружии и средствах защиты',
            '6': 'о новых научных открытиях',
        },
    },
    'message_11': {
        'text': '6. Из шести возможных профилей обучения я выберу',
        'buttons': {
            '1': ('медицинский или психолого-педагогический профиль '
                  '(хочу лечить людей; обучать; разбираться в причинах '
                  'их поведения и помогать решать психологические проблемы)'),
            '2': ('художественно-эстетический профиль '
                  '(хочу заниматься творчеством: писать картины, '
                  'танцевать, петь, снимать кино, выступать в театре и др.)'),
            '3': ('информационно-технологический профиль '
                  '(хочу работать в IT, разрабатывать умные машины '
                  'и технологии)'),
            '4': ('индустриально-технологический профиль '
                  '(хочу быть инженером и руководить рабочим'
                  ' процессом в промышленности, машиностроении)'),
            '5': ('военно-спортивный профиль '
                  '(люблю спорт, хочу быть сильным и стать военным)'),
            '6': ('академический профиль '
                  '(хочу быть ученым и хорошо разбираться в своей области)'),
        },
    },
    'message_12': {
        'text': '7. Мне интереснее было бы',
        'buttons': {
            '1': 'предлагать людям товары и услуги',
            '2': 'заниматься дизайном изделий',
            '3': 'организовывать рекламную кампанию',
            '4': 'делать что-то своими руками',
            '5': 'участвовать в соревнованиях',
            '6': 'решать сложные задачи',
        },
    },
    'message_13': {
        'text': '8. Я думаю, что школа должна',
        'buttons': {
            '1': 'учить общению с другими людьми',
            '2': 'воспитывать чувство прекрасного',
            '3': 'обучать навыкам работы с информацией',
            '4': 'обучать навыкам практической работы',
            '5': 'обучать основам безопасности жизнедеятельности и выживания',
            '6': 'развивать мышление',
        },
    },
    'message_14': {
        'text': '9. В свободное время я предпочитаю',
        'buttons': {
            '1': 'общаться с друзьями и знакомиться с новыми людьми',
            '2': ('ходить на художественные выставки, '
                  'концерты и спектакли, в музеи'),
            '3': 'узнавать что-то новое из книг, интернета, СМИ',
            '4': ('что-нибудь мастерить, готовить, '
                  'ухаживать за кем-то (чем-то)'),
            '5': 'тренироваться',
            '6': 'конструировать, создавать что-то новое',
        },
    },
    'message_15': {
        'text': '10. Думаю, что мне будет комфортно работать',
        'buttons': {
            '1': 'в помещении с большим количеством людей',
            '2': 'в мастерской или студии',
            '3': 'дома или в обычном кабинете',
            '4': 'на свежем воздухе или в специально оборудованном помещении',
            '5': 'в экстремальных условиях',
            '6': 'дома, в обычном кабинете или лаборатории',
        },
    },
    'message_16': {
        'text': (
            'У тебя склонность к:\n'
            '1. {}\n'
            '2. {}\n'
            '3. {}\n'
        ),
        'buttons': [
            ['Далее']
        ]
    },
}
