RESULT_MESSAGE = "Твои ценностные ориентации: \n\n"
TASK_4_CANCELLATION_TEXT = (
    "Прохождение задания прервано. Если хочешь начать его сначала,"
    ' то ты можешь открыть меню, перейти в "Мои задания" и выбрать Задание 4.'
)
TEXT_OF_START_OF_TASK_4 = (
    "Насколько ты согласен с каждым из следующих утверждений? "
    "Варианты ответов:\n"
    "1 – совершенно не согласен, 10 – полностью согласен.\n\n"
)
QUESTIONS = [
    (
        "Мне важно строить свою карьеру в пределах конкретной научной или "
        "технической сферы."
    ),
    (
        "Мне важно наблюдать за людьми, контролировать их, влиять на них на "
        "всех уровнях."
    ),
    (
        "Мне важно иметь возможность делать все по-своему и не быть стесненным "
        "правилами какой-либо организации."
    ),
    (
        "Мне важно иметь постоянное место работы с гарантированным окладом и "
        "социальной защищенностью."
    ),
    (
        "Мне важно использоватьь свое умение общаться на пользу людям, "
        "помогать другим."
    ),
    (
        "Мне важно работать над проблемами, которые кажутся почти "
        "неразрешимыми."
    ),
    (
        "Мне важно вести такой образ жизни, чтобы интересы семьи и карьеры "
        "взаимно уравновешивали друг друга."
    ),
    (
        "Мне важно создать и построить нечто, что будет всецело моим "
        "произведением или идеей."
    ),
    (
        "Мне важно продолжать работу по своей специальности, чем получить "
        "более высокую должность, не связанную с моей специальностью."
    ),
    (
        "Мне важно быть первым (главным) руководителем в организации."
    ),
    (
        "Мне важно иметь работу, не связанную с режимом или другими "
        "организационными ограничениями."
    ),
    (
        "Мне важно работать в организации, которая обеспечит мне стабильность "
        "на долгое время."
    ),
    (
        "Мне важно применять свои умения и способности, чтобы сделать мир "
        "лучше."
    ),
    (
        "Мне важно соревноваться с другими и побеждать."
    ),
    (
        "Мне важно строить карьеру, которая позволит мне не изменять своему "
        "образу жизни."
    ),
    (
        "Мне важно создать новое коммерческое предприятие."
    ),
    (
        "Мне важно посвятить всю жизнь избранной профессии."
    ),
    (
        "Мне важно занять высокую руководящую должность."
    ),
    (
        "Мне важно иметь работу, которая представляет максимум свободы и "
        "автономии в выборе характера занятий, времени выполнения и т.д."
    ),
    (
        "Мне важно оставаться на одном месте жительства, а не  переезжать в "
        "связи с повышением."
    ),
    (
        "Мне важно иметь возможность использовать свои умения и таланты для "
        "служения значимой цели."
    ),
    (
        "Единственная действительная цель моей карьеры – находить и решать "
        "серьезные проблемы, независимо от того, в какой области они возникли."
    ),
    (
        "Я всегда стремлюсь уделять одинаковое внимание моей семье и моей "
        "карьере."
    ),
    (
        "Я всегда нахожусь в поиске идей, которые дадут мне возможность начать "
        "и построить свое собственное дело."
    ),
    (
        "Я соглашусь на руководящую должность только в том случае, если она "
        "находится в моей профессиональной компетенции."
    ),
    (
        "Я хотел бы достичь такого положения в организации, которое позволяло "
        "бы наблюдать за работой других и управлять  их деятельностью."
    ),
    (
        "В моей профессиональной деятельности я более всего заботился бы о "
        "своей свободе и автономии."
    ),
    (
        "Для меня важнее остаться на нынешнем месте жительства, чем получить "
        "повышение или новую работу в другой деятельности."
    ),
    (
        "Я всегда искал работу, на которой мог бы приносить пользу другим."
    ),
    (
        "Соревнование и выигрыш – это наиболее важные и волнующие стороны моей "
        "карьеры."
    ),
    (
        "Карьера имеет смысл только в том случае, если она позволяет вести "
        "жизнь, которая мне нравится."
    ),
    (
        "Предпринимательская деятельность составляет центральную часть моей "
        "карьеры."
    ),
    (
        "Я бы скорее ушел из организации, чем стал заниматься работой, не "
        "связанной с моей профессией."
    ),
    (
        "Я буду считать, что достиг успеха в карьере только тогда, когда стану "
        "руководителем высокого уровня в солидной организации."
    ),
    (
        "Я не хочу, чтобы меня стесняли какая-нибудь организация или мир "
        "бизнеса."
    ),
    (
        "Я бы предпочел работать в организации, с которой заключен длительный "
        "контракт."
    ),
    (
        "Я бы хотел посвятить свою карьеру достижению важной и полезной цели."
    ),
    (
        "Я чувствую себя преуспевающим только тогда, когда я постоянно "
        "вовлечен в решение трудных проблем или в ситуацию соревнования."
    ),
    (
        "Выбрать и поддерживать определенный образ жизни важнее, чем "
        "добиваться успеха в карьере."
    ),
    (
        "Я всегда хотел основать и построить свой собственный бизнес."
    ),
    (
        "Я предпочитаю работу, которая не связана с командировками."
    ),
]
