START = (
    'Ниже 70 вопросов, в каждом из них – два утверждения. Выбери то '
    'продолжение, которое свойственно тебе больше всего. Важно: подолгу не '
    'задумывайся над ответами!\n\n'
)
MESSAGE_18 = (
    '1. В компании (на вечеринке) ты:\n\n'
    'а) общаешься со многими, включая и незнакомцев\n'
    'б) общаешься с немногими – твоими знакомыми'
)
MESSAGE_19 = (
    '2. Ты человек скорее:\n\n'
    'а) реалистичный, чем склонный теоретизировать\n'
    'б) склонный теоретизировать, чем реалистичный'
)
MESSAGE_20 = (
    '3. По-твоему, что хуже:\n\n'
    'а) «витать в облаках»\n'
    'б) придерживаться проторенной дорожки'
)
MESSAGE_21 = (
    '4. Ты более подвержен влиянию:\n\n'
    'а) принципов, законов\n'
    'б) эмоций, чувств'
)
MESSAGE_22 = (
   '5. Ты более склонен:\n\n'
    'а) убеждать\n'
    'б) затрагивать чувства'
)
MESSAGE_23 = (
    '6. Ты предпочитаешь работать:\n\n'
    'а) выполняя все точно в срок\n'
    '6) не связывая себя определенными сроками'
)
MESSAGE_24 = (
    '7. Ты склонен делать выбор:\n\n'
    'а) довольно осторожно\n'
    '6) внезапно импульсивно'
)
MESSAGE_25 = (
    '8. В компании (на вечеринке) ты:\n\n'
    'a) остаешься допоздна, не чувствуя усталости\n'
    'б) быстро утомляешься и предпочитаешь пораньше уйти' 
)
MESSAGE_26 = (
    '9. Тебя бoлee привлекают:\n\n'
    'а) здравомыслящие люди\n'
    'б) люди с богатым воображением'
)
MESSAGE_27 = (
    '10. Тебе интереснее:\n\n'
    'а) то, что происходит в действительности\n'
    'б) те события, которые могут произойти'
)
MESSAGE_28 = (
    '11. Оценивая поступки людей, ты больше учитываешь:\n\n'
    'а) требования закона, чем обстоятельства\n'
    'б) обстоятельства, чем требования закона'
)
MESSAGE_29 = (
    '12. Обращаясь к другим, ты склонен:\n\n'
    'а) соблюдать формальности, этикет\n'
    'б) проявлять свои личные, индивидуальные качества'
)
MESSAGE_30 = (
    '13. Ты человек скорее:\n\n'
    'а) точный, пунктуальный\n'
    'б) неторопливый, медленный'
)
MESSAGE_31 = (
    '14. Тебя больше беспокоит необходимость:\n\n'
    'а) оставлять дела незаконченными\n'
    'б) непременно доводить дело до конца'
)
MESSAGE_32 = (
    '15. В кругу знакомых ты, как правило:\n\n'
    'а) в куpce происходящих событий\n'
    'б) узнаешь о новостях с опозданием'
)
MESSAGE_33 = (
    '16. Повседневные дела тебе нравится делать:\n\n'
    'а) общепринятым способом\n'
    'б) своим оригинальным способом'
)
MESSAGE_34 = (
    '17. Предпочитаешь таких писателей, которые:\n\n'
    'а) выражаются буквально, напрямую\n'
    'б) пользуются аналогиями, иносказаниями'
)
MESSAGE_35 = (
    '18. Что тебя больше привлекает:\n\n'
    'а) стройность мысли\n'
    'б) гармония человеческих отношений'
)
MESSAGE_36 = (
    '19. Ты чувствуешь себя увереннее:\n\n'
    'а) в логических умозаключениях\n'
    'б) в практических оценках ситуаций'
)
MESSAGE_37 = (
    '20. Ты предпочитаешь, когда дела:\n\n'
    'а) решены и устроены\n'
    'б) не решены и не устроены'
)
MESSAGE_38 = (
    '21. Как по-твоему, ты человек:\n\n'
    'а) серьезный, определенный\n'
    'б) беззаботный, беспечный'
)
MESSAGE_39 = (
    '22. При телефонных разговорах ты:\n\n'
    'а) заранее не продумываешь то, что надо сказать\n'
    'б) мысленно репетируешь то, что будет сказано'
)
MESSAGE_40 = (
    '23. Как ты считаешь, факты:\n\n'
    'а) важны сами по себе\n'
    'б) ecть проявление общих закономерностей'
)
MESSAGE_41 = (
    '24. Фантазеры, мечтатели:\n\n'
    'а) раздражают тебя\n'
    'б) довольно симпатичны тебе'
)
MESSAGE_42 = (
    '25. Ты чаще действуешь как человек:\n\n'
    'а) хладнокровный\n'
    'б) вспыльчивый, горячий'
)
MESSAGE_43 = (
    '26. По-твоему, хуже быть:\n\n'
    'а) несправедливым\n'
    'б) беспощадным'
)
MESSAGE_44 = (
    '27. Обычно ты предпочитаешь действовать:\n\n'
    'а) тщательно оценив возможности\n'
    'б) полагаясь на волю случая'
)
MESSAGE_45 = (
    '28. Тебе приятнее:\n\n'
    'а) покупать что-то\n'
    'б) иметь возможность купить'
)
MESSAGE_46 = (
    '29. В компании ты как правило:\n\n'
    'а) первым заводишь беседу\n'
    'б) ждешь, когда с тобой заговорят'
)
MESSAGE_47 = (
    '30. Здравый смысл:\n\n'
    'а) редко ошибается\n'
    'б) часто попадает впросак'
)
MESSAGE_48 = (
    '31. Детям часто не хватает:\n\n'
    'а) практичности\n'
    'б) воображения'
)
MESSAGE_49 = (
    '32. В принятии решений ты руководствуешься скорее:\n\n'
    'а) принятыми нормами\n'
    'б) своими чувствами, ощущениями'
)
MESSAGE_50 = (
    '33. Ты человек скорее:\n\n'
    'а) твердый, чем мягкий\n'
    'б) мягкий, чем твердый'
)
MESSAGE_51 = (
    '34. Что, по-твоему, больше впечатляет:\n\n'
    'а) умение методично организовывать\n'
    'б) умение приспособиться и довольствоваться достигнутым'
)
MESSAGE_52 = (
    '35. Ты больше ценишь:\n\n'
    'а) определенность, законченность\n'
    'б) открытость, многовариантность'
)
MESSAGE_53 = (
    '36. Новые и нестандартные отношении с людьми:\n\n'
    'а) стимулируют, придают тебе энергии\n'
    'б) утомляют'
)
MESSAGE_54 = (
    '37. Ты чаще действуешь как:\n\n'
    'а) человек практического склада\n'
    'б) человек оригинальный, необычный'
)
MESSAGE_55 = (
    '38. Ты более склонен:\n\n'
    'а) находить пользу в отношениях с людьми\n'
    'б) понимать мысли и чувства других'
)
MESSAGE_56 = (
    '39. Что приносит тебе больше удовлетворения:\n\n'
    'а) тщательное всестороннее обсуждение спорного вопроса\n'
    'б) достижения соглашения по поводу спорного вопроса'
)
MESSAGE_57 = (
    '40. Ты руководствуешься более:\n\n'
    'а) рассудком\n'
    'б) велениями сердца'
)
MESSAGE_58 = (
    '41. Тебе удобнее выполнять работу:\n\n'
    'а) по предварительной договоренности\n'
    'б) которая подвернулась случайно'
)
MESSAGE_59 = (
    '42. Ты обычно полагаешься:\n\n'
    'а) на организованность, порядок\n'
    'б) на случайность, неожиданность'
)
MESSAGE_60 = (
    '43. Ты предпочитаешь иметь:\n\n'
    'а) много друзей на непродолжительный срок\n'
    'б) несколько старых друзей'
)
MESSAGE_61 = (
    '44. Ты руководствуешься в большей степени:\n\n'
    'а) фактами, обстоятельствами\n'
    'б) общим положениями, принципами'
)
MESSAGE_62 = (
    '45. Тебя больше интересуют:\n\n'
    'а) производство и сбыт продукции\n'
    'б) проектирование и исследования'
)
MESSAGE_63 = (
    '46. Что ты скорее сочтешь за комплимент:\n\n'
    'а) «Ты очень логичный человек»\n'
    'б) «Ты тонко чувствующий человек»'
)
MESSAGE_64 = (
    '47. Ты более ценишь в себе:\n\n'
    'а) невозмутимость\n'
    'б) увлеченность'
)
MESSAGE_65 = (
    '48. Ты предпочитаешь высказывать:\n\n'
    'а) окончательные и определенные утверждения\n'
    'б) предварительные и неоднозначные утверждения'
)
MESSAGE_66 = (
    '49. Ты лучше чувствуешь себя:\n\n'
    'а) после принятия решения\n'
    'б) не ограничивая себя решениями'
)
MESSAGE_67 = (
    '50. Общаясь с незнакомыми ты:\n\n'
    'а) легко завязываешь продолжительные беседы\n'
    'б) не всегда находишь общие темы для разговора'
)
MESSAGE_68 = (
    '51. Ты больше доверяешь:\n\n'
    'a) своему опыту\n'
    'б) своим предчувствиям'
)
MESSAGE_69 = (
    '52. Ты чувствуешь себя человеком:\n\n'
    'а) более практичным, чем изобретательным\n'
    'б) более изобретательным, чем практичным'
)
MESSAGE_70 = (
    '53. Кто заслуживает больше одобрения:\n\n'
    'а) рассудительный, здравомыслящий человек\n'
    'б) глубоко переживающий человек'
)
MESSAGE_71 = (
    '54. Ты более склонен:\n\n'
    'а) быть прямым и беспристрастным\n'
    'б) сочувствовать людям'
)
MESSAGE_72 = (
    '55. Что, по-твоему, предпочтительней:\n\n'
    'а) удостовериться, что все подготовлено и улажено\n'
    'б) предоставить событиям идти своим чередом'
)
MESSAGE_73 = (
    '56. Отношения между людьми должны строиться:\n\n'
    'а) на предварительной взаимной договоренности\n'
    'б) в зависимости от обстоятельств'
)
MESSAGE_74 = (
    '57. Когда звонит телефон, ты:\n\n'
    'а) торопишься подойти первым\n'
    'б) надеешься, что подойдет кто-нибудь другой'
)
MESSAGE_75 = (
    '58. Что ты цените в себе больше:\n\n'
    'а) развитое чувство реальности\n'
    'б) пылкое воображение'
)
MESSAGE_76 = (
    '59. Ты больше придаешь значение:\n\n'
    'а) тому, что сказано\n'
    'б) тому, как сказано'
)
MESSAGE_77 = (
    '60. Что выглядит большим заблуждением:\n\n'
    'а) излишняя пылкость, горячность\n'
    'б) чрезмерная объективность, беспристрастность'
)
MESSAGE_78 = (
    '61. Ты в основном считаешь себя:\n\n'
    'а) трезвым и практичным\n'
    'б) сердечным и отзывчивым'
)
MESSAGE_79 = (
    '62. Какие ситуации привлекают тебя больше:\n\n'
    'а) регламентированные и упорядоченные\n'
    'б) неупорядоченные и нерегламентированные'
)
MESSAGE_80 = (
    '63. Ты человек скорее:\n\n'
    'а) педантичный, чем капризный\n'
    'б) капризный, чем педантичный'
)
MESSAGE_81 = (
    '64. Ты чаще склонен:\n\n'
    'a) быть открытым, доступным людям\n'
    'б) быть сдержанным, скрытным'
)
MESSAGE_82 = (
    '65. В литературных произведениях ты предпочитаешь:\n\n'
    'а) буквальность, конкретность\n'
    'б) образность, переносный смысл'
)
MESSAGE_83 = (
    '66. Что для тебя труднее:\n\n'
    'а) находить общий язык\n'
    'б) использовать других в своих интересах'
)
MESSAGE_84 = (
    '67. Что бы ты себе больше пожелал:\n\n'
    'а) ясности размышлений\n'
    'б) умения сочувствовать'
)
MESSAGE_85 = (
    '68. Что хуже:\n\n'
    'а) быть неприхотливым\n'
    'б) быть излишне привередливым'
)
MESSAGE_86 = (
    '69. Ты предпочитаешь:\n\n'
    'а) запланированные события\n'
    'б) незапланированные события'
)
MESSAGE_87 = (
    '70. Ты склонен поступать скорее:\n\n'
    'а) обдуманно, чем импульсивно\n'
    'б) импульсивно, чем обдуманно'
)
DESCRIPTION_MESSAGE = 'Расшифровка'
STOP = 'Окончание работы!'
