GO_BUTTON_LABEL = "Начать"
HELLO_BUTTON_LABEL = "Привет"
FIRST_TASK_BUTTON_LABEL = "Задание 1"

CONNECTION_ERROR_MESSAGE = "Сбой сети. Попробуйте позже."
DATA_ERROR_MESSAGE = "Неправильные данные. Обратитесь к администратору."
INTERNAL_ERROR_MESSAGE = "Ошибка. Обратитесь к администратору бота."
SERVER_ERROR_MESSAGE = "Сбой сервера. Попробуйте позже или обратитесь в поддержку."

START = "start"
START_ACQUAINTANCE = "start_acquaintance"
START_SKILL_SETS = "start_skill_sets"

ALLOWED_TARIFFS_START_MESSAGE = (
    "Привет, {name}! Спасибо, что выбрал проект YOU CAN!\n\n"
    "Ближайшее время мы проведем вместе."
    " Надеемся, что оно будет интересным и продуктивным для тебя."
    " С нами ты определишь свои сильные стороны и выберешь профессию,"
    " которая поможет их раскрыть."
)
NOT_ALLOWED_TARIFFS_START_MESSAGE = (
    "Привет, {name}!\n\n"
    'Доступ к рабочей тетради "YOU CAN — Профдизайн" возможен'
    " на тарифе Midi или Maxi.\n\n"
    "Если хочешь сделать апгрейд своего тарифа, напиши Катерине Бриль @katerina_bril."
)
UNKNOWN_START_MESSAGE = (
    "Привет, дорогой друг!\n\n"
    'У тебя пока что нет доступа к рабочей тетради "YOU CAN — Профдизайн".\n\n'
    "Чтобы его получить, необходимо приобрести пакет Midi или Maxi"
    " на сайте проекта youcan.by"
)

SKILL_SET_INFORMATION = (
    "Итак, наша программа по профдизайну состоит из трех скилсетов"
    " (с англ. – «набор навыков»).\n\n"
    "- Скилсет 1. Раскрой свой потенциал – с помощью тестов и игровых методик"
    " ты узнаешь не только свои сильные стороны, но и таланты.\n\n"
    "- Скилсет 2. Изучи современные профессии – вместе с роботом-гуру"
    " ты изучишь профессии через призму твоего потенциала.\n\n"
    "- Скилсет 3. Сделай выбор и действуй – с помощью специальной матрицы"
    " ты сам сделаешь свой профессиональный выбор и составишь"
    " образовательный маршрут."
)
FIRST_SKILL_SET_INFORMATION = (
    "В этом чат-боте мы выполним скилсет «Раскрой свой потенциал»."
    " Он состоит из 8 заданий. Это поможет мне узнать тебя чуть ближе,"
    " а ты сможешь открыть новые грани своей личности!"
)
COMMAND_PROHIBITED = (
    "Сейчас выполняется другая команда, завершите диалог "
    "по ней, только после этого вводите следующую."
)
COMMAND_PROHIBITED_ON_TASK = (
    "Завершите выполнение Заданий, после этого вы сможете использовать команды."
)
