HELLO_BUTTON_LABEL = 'ПРИВЕТ'
START_BUTTON_LABEL = 'НАЧАТЬ'
FIRST_TASK_BUTTON_LABEL = 'ЗАДАНИЕ 1'

START_MESSAGE = """
Привет, дорогой друг! Спасибо, что выбрал проект YOU CAN! 
Ближайшее время мы проведем вместе. Надеемся, что оно будет интересным 
и продуктивным для тебя. С нами ты определишь свои сильные стороны 
и выберешь профессию, которая поможет их раскрыть
"""


YOUR_NAME_QUESTION = 'Как тебя зовут?'

SKILL_SET_INFORMATION = """
Приятно познакомиться, {}!\n\n
Итак, наша программа по профдизайну состоит из трех скилсетов 
(с англ. – «набор навыков»).\n\n
- Скилсет 1. Раскрой свой потенциал – с помощью тестов и игровых методик 
ты узнаешь не только свои сильные стороны, но и таланты.\n
- Скилсет 2. Изучи современные профессии – вместе с роботом-гуру 
ты изучишь профессии через призму твоего потенциала.\n
- Скилсет 3. Сделай выбор и действуй – с помощью специальной матрицы ты сам 
сделаешь свой профессиональный выбор и составишь образовательный маршрут.
"""

FIRST_SKILL_SET_INFORMATION = """
В этом чат-боте мы выполним скилсет «Раскрой свой потенциал». 
Он состоит из 8 заданий. Это поможет мне узнать тебя чуть ближе, 
а ты сможешь открыть новые грани своей личности!
"""

CANCEL_ACQUAINTANCE = ('Диалог прерван. '
                       'Если хотите начать его сначала, то введите /start')
