GO_BUTTON_LABEL = "Начать"
HELLO_BUTTON_LABEL = "Привет"
FIRST_TASK_BUTTON_LABEL = "Задание 1"

CONNECTION_ERROR_MESSAGE = "Сбой сети. Попробуйте позже."
DATA_ERROR_MESSAGE = "Неправильные данные. Обратитесь к администратору."
INTERNAL_ERROR_MESSAGE = "Ошибка. Обратитесь к администратору бота."
SERVER_ERROR_MESSAGE = "Сбой сервера. Попробуйте позже или обратитесь в поддержку."

START = "start"
SHOW_SKILL_SET_INFO = "show_skill_set_info"

ALLOWED_TARIFFS_START_MESSAGE = (
    "Привет, {name} 👋\n\nСпасибо, что выбрал проект YOU CAN!\n\n"
    "Ближайшее время мы проведем вместе."
    " Надеемся, что оно будет интересным и продуктивным для тебя."
    " С нами ты определишь свои сильные стороны и выберешь профессию,"
    " которая поможет их раскрыть."
)
NOT_ALLOWED_TARIFFS_START_MESSAGE = (
    "Привет, {name}!\n\n"
    'Доступ к рабочей тетради "YOU CAN — Профдизайн" возможен'
    " на тарифе Midi или Maxi.\n\n"
    "Если хочешь сделать апгрейд своего тарифа, напиши Катерине Бриль @katerina_bril."
)
UNKNOWN_START_MESSAGE = (
    "Привет, дорогой друг!\n\n"
    'У тебя пока что нет доступа к рабочей тетради "YOU CAN — Профдизайн".'
    " Чтобы его получить, необходимо приобрести пакет Midi или Maxi"
    " на сайте проекта youcan.by."
)

SKILL_SET_INFORMATION = (
    "Мы создали этот бот, чтобы ты мог самостоятельно, без спешки, в своем темпе "
    "пройти скилсет (с англ. – «набор навыков»)."
    " Он состоит из восьми заданий,"
    " которые помогут тебе узнать свои сильные стороны и таланты.\n\n"
    "Когда ты пройдешь скилсет, мы проанализируем твои результаты,"
    " расскажем о них в голосовом сообщении в Telegram и наметим дальнейшие шаги."
)
COMMAND_PROHIBITED = (
    "<b>Сейчас выполняется другая команда</b>.\n\n"
    "Заверши диалог по ней и только после этого введи следующую."
)
COMMAND_PROHIBITED_ON_TASK = (
    "Чтобы использовать другие команды из меню,"
    " <u>необходимо завершить выполнение данного задания</u>."
)
