RESULT_MESSAGE = "Твой тип личности: \n\n"
TASK_3_CANCELLATION_TEXT = (
    "Прохождение задания прервано. Если хочешь начать его сначала,"
    ' то ты можешь открыть меню, перейти в "Мои задания" и выбрать Задание 3.'
)
TEXT_OF_START_OF_TASK_3 = (
    "Сейчас тебе будут представлены 42 пары различных видов деятельности. "
    "Если бы тебе пришлось выбирать лишь одну работу из каждой пары, "
    "что бы ты предпочёл?\n\n"
)
QUESTIONS = [
    (
        "\n"
        "а) инженер-конструктор\n"
        "б) инженер-технолог"
    ),
    (
        "\n"
        "а) терапевт\n"
        "б) радиотехник"
    ),
    (
        "\n"
        "а) кодировщик информации\n"
        "б) оператор станков с программным управлением"
    ),
    (
        "\n"
        "а) бизнесмен\n"
        "б) фотограф"
    ),
    (
        "\n"
        "а) дизайнер\n"
        "б) спасатель МЧС"
    ),
    (
        "\n"
        "а) психиатр\n"
        "б) политолог"
    ),
    (
        "\n"
        "а) бухгалтер\n"
        "б) ученый-химик"
    ),
    (
        "\n"
        "а) частный предприниматель\n"
        "б) философ"
    ),
    (
        "\n"
        "а) модельер\n"
        "б) лингвист"
    ),
    (
        "\n"
        "а) статист\n"
        "б) инспектор службы занятости населения"
    ),
    (
        "\n"
        "а) брокер\n"
        "б) социальный педагог"
    ),
    (
        "\n"
        "а) искусствовед\n"
        "б) тренер"
    ),
    (
        "\n"
        "а) менеджер\n"
        "б) нотариус"
    ),
    (
        "\n"
        "а) художник\n"
        "б) печатник"
    ),
    (
        "\n"
        "а) писатель\n"
        "б) лидер общественного движения"
    ),
    (
        "\n"
        "а) метеоролог\n"
        "б) модельер"
    ),
    (
        "\n"
        "а) работник пресс-службы\n"
        "б) водитель"
    ),
    (
        "\n"
        "а) чертежник\n"
        "б) риелтор"
    ),
    (
        "\n"
        "а) специалист по ремонту компьютеров и оргтехники\n"
        "б) секретарь-референт"
    ),
    (
        "\n"
        "а) микробиолог\n"
        "б) психолог"
    ),
    (
        "\n"
        "а) видеооператор\n"
        "б) режиссер"
    ),
    (
        "\n"
        "а) экономист\n"
        "б) провизор"
    ),
    (
        "\n"
        "а) зоолог\n"
        "б) главный инженер"
    ),
    (
        "\n"
        "а) программист\n"
        "б) архитектор"
    ),
    (
        "\n"
        "а) работник инспекции по делам несовершеннолетних\n"
        "б) маркетолог"
    ),
    (
        "\n"
        "а) преподаватель\n"
        "б) трейдер"
    ),
    (
        "\n"
        "а) воспитатель\n"
        "б) декоратор"
    ),
    (
        "\n"
        "а) реставратор\n"
        "б) заведующий отделом предприятия"
    ),
    (
        "\n"
        "а) корректор\n"
        "б) литератор и кинокритик"
    ),
    (
        "\n"
        "а) фермер\n"
        "б) визажист"
    ),
    (
        "\n"
        "а) парикмахер\n"
        "б) социолог"
    ),
    (
        "\n"
        "а) экспедитор\n"
        "б) редактор"
    ),
    (
        "\n"
        "а) ветеринар\n"
        "б) финансовый директор"
    ),
    (
        "\n"
        "а) автомеханик\n"
        "б) стилист"
    ),
    (
        "\n"
        "а) археолог\n"
        "б) эксперт"
    ),
    (
        "\n"
        "а) библиограф\n"
        "б) корреспондент"
    ),
    (
        "\n"
        "а) эколог\n"
        "б) актер"
    ),
    (
        "\n"
        "а) логопед\n"
        "б) контролер"
    ),
    (
        "\n"
        "а) адвокат\n"
        "б) директор организации"
    ),
    (
        "\n"
        "а) кассир\n"
        "б) продюсер"
    ),
    (
        "\n"
        "а) поэт, писатель\n"
        "б) продавец"
    ),
    (
        "\n"
        "а) криминалист\n"
        "б) композитор"
    ),
]
