TEST_2_RESULTS = {
    'ESFP': ('Исполнитель (ESFP)\n'
             'Личностные особенности: '
             'деятельные, ценят здравый смысл.\n'
             'Примеры профессий: '
             'детский психолог, терапевт, актер, дизайнер, ученый-эколог.\n'),
    'ISFP': ('Композитор (ISFP)\n'
             'Личностные особенности: '
             'теплые и чувствующие, любят помогать ощутимыми способами.\n'
             'Примеры профессий: '
             'модельер, физиотерапевт, массажист, ландшафтный архитектор.\n'),
    'ESTP': ('Деятель (ESTP)\n'
             'Личностные особенности: '
             'прагматики, которые преуспевают в любом кризисе.\n'
             'Примеры профессий: '
             'детектив, банкир, инвестор, аниматор, фитнес-тренер.\n'),
    'ISTP': ('Мастер (ISTP)\n'
             'Личностные особенности: '
             'прямые, предпочитают делать, а не говорить.\n'
             'Примеры профессий: '
             'строитель, экономист, пилот, аналитик данных, врач скорой помощи.\n'),
    'ESFJ': ('Провайдер (ESFJ)\n'
             'Личностные особенности: '
             'общительные, традиционалисты, помогают другим.\n'
             'Примеры профессий: '
             'менеджер продаж, медработник, социальный работник, '
             'PR-менеджер, кредитный специалист.\n'),
    'ISFJ': ('Воспитатель (ISFJ)\n'
             'Личностные особенности: '
             'скромные и решительные, помогают другим.\n'
             'Примеры профессий: '
             'стоматолог, учитель, библиотекарь, владелец франшизы, '
             'сотрудник поддержки.\n'),
    'ESTJ': ('Супервайзер (ESTJ)\n'
             'Личностные особенности: '
             'реалисты, быстро принимающие решения.\n'
             'Примеры профессий: '
             'страховой агент, фармацевт, юрист, менеджер проектов, судья.\n'),
    'ISTJ': ('Инспектор (ISTJ)\n'
             'Личностные особенности: '
             'работяги, ценят обязанности и обязательства.\n'
             'Примеры профессий: '
             'аудитор, бухгалтер, финансист, веб-разработчик, '
             'государственный служащий.\n'),
    'ENFJ': ('Наставник (ENFJ)\n'
             'Личностные особенности: '
             'любят людей, энергичны и дипломатичны.\n'
             'Примеры профессий: '
             'PR-менеджер, социальный работник, корпоративный коуч, '
             'менеджер по продажам, HR-специалист.\n'),
    'INFJ': ('Советник (INFJ)\n'
             'Личностные особенности: '
             'вдумчивые, двигаемые твердыми принципами.\n'
             'Примеры профессий: '
             'психотерапевт, социальный работник, '
             'консультант по организационному развитию, клиентский менеджер.\n'),
    'ENFP': ('Чемпион (ENFP)\n'
             'Личностные особенности: '
             'любопытный тип, который везде видит возможности.\n'
             'Примеры профессий: '
             'журналист, консультант, ресторатор, event-менеджер.\n'),
    'INFP': ('Идеалист (INFP)\n'
             'Личностные особенности: '
             'идеалист, движимый своими ценностями.\n'
             'Примеры профессий: '
             'графический дизайнер, психотерапевт, писатель, '
             'физиотерапевт, HR-специалист.\n'),
    'ENTJ': ('Командир (ENTJ)\n'
             'Личностные особенности: '
             'природные лидеры, аналитики с хорошей логикой, стратеги.\n'
             'Примеры профессий: '
             'руководитель, юрист, аналитик рынка, венчурный капиталист.\n'),
    'INTJ': ('Вдохновитель (INTJ)\n'
             'Личностные особенности: '
             'творческие перфекционисты, делают все по-своему.\n'
             'Примеры профессий: '
             'инвестиционный банкир, финансовый консультант, '
             'разработчик ПО, экономист, руководитель.\n'),
    'ENTP': ('Визионер (ENTP)\n'
             'Личностные особенности: '
             'предприимчивые люди, которым нравятся вызовы.\n'
             'Примеры профессий: '
             'предприниматель, разработчик ПО, политик, специалист по маркетингу.\n'),
    'INTP': ('Мыслитель (INTP)\n'
             'Личностные особенности: '
             'независимые, любят решать проблемы.\n'
             'Примеры профессий: '
             'разработчик ПО, финансовый аналитик, архитектор, '
             'преподаватель, экономист.\n'),
}
